import { Recipe } from '../../model';

export const mockRecipes: Recipe[] = [
	{
		id: 1,
		name: 'Срагу',
		description: `
			Срагу не пожелаешь врагу.
			1. Порезать тухлые овощи бензопилой.
			2. Залить кислой мочой.
			3. Бросить на сковороду.
			4. Медленно размораживать огнеметом.
		`,
		ingredients: ['картошка', 'морковь', 'яйца бобра', 'сопли слона']
	},
	{
		id: 2,
		name: 'Каклеты',
		description: `
			Каклеты не выйдешь с туалета.
			1. Бросить на пол прошлогоднюю курицу.
			2. Равномерно протирать ею пол в течение 15 минут.
			3. Высморкаться на нее и бросить в холодильник.
			4. Смотать две гранаты скотчем.
			5. Сорвать с гранат чеку и бросить в холодильник вслед за курицей.
			6. Позвонить мне и рассказать, что было дальше.
		`,
		ingredients: ['курица', 'сопли', 'холодильник', 'граната', 'скотч', 'телефон']
	},
	{
		id: 3,
		name: 'Харкаша',
		description: `
			Харкаша - полна тарелка параши.
			1. Достать из холодильника кастрюлю блевотины. (есть у каждой хозяйки)
			2. Поставить в духовку на 2 дня.
			3. Добавить ногтей и серы из ушей по вкусу.
			4. Подавать со слегка дебильным лицом.
		`,
		ingredients: ['блевотина', 'ногти', 'ушная сера', 'дебильное лицо'],
	},
];